In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['row1','row2','row3','row4','row5'],columns=['column1','column2','column3','column4'])
df

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [4]:
df.loc['row1']

column1    0
column2    1
column3    2
column4    3
Name: row1, dtype: int64

In [5]:
type(df.loc['row1'])

pandas.core.series.Series

In [6]:
df.iloc[0:2,0:2]

      column1  column2
row1        0        1
row2        4        5

In [7]:
type(df.iloc[0:2,0:1])

pandas.core.frame.DataFrame

In [8]:
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [9]:
df.iloc[:,1:].value_counts()

column2  column3  column4
1        2        3          1
5        6        7          1
9        10       11         1
13       14       15         1
17       18       19         1
dtype: int64

In [10]:
df.iloc[:,1:].values.shape

(5, 3)

In [11]:
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [21]:
d = {'name':pd.Series('abhi',index=[0]),'salary':pd.Series(50000,index=[0]),'designation':pd.Series('AI/ML Engineer',index=[0]),'Hobbies':pd.Series('chess,cricket,TT',index=[0,1,2])}
df = pd.DataFrame(d,index=[0,1,2])
df

   name   salary     designation           Hobbies
0  abhi  50000.0  AI/ML Engineer  chess,cricket,TT
1   NaN      NaN             NaN  chess,cricket,TT
2   NaN      NaN             NaN  chess,cricket,TT

In [22]:
df.isnull().sum()

name           2
salary         2
designation    2
Hobbies        0
dtype: int64

In [28]:
df.dtypes

name            object
salary         float64
designation     object
Hobbies         object
dtype: object

In [29]:
numerical_features = [feature for feature in df.columns if df[feature].dtypes!='O']

In [30]:
numerical_features

['salary']

In [32]:
categorical_features = [feature for feature in df.columns if df[feature].dtypes=='O']
categorical_features

['name', 'designation', 'Hobbies']